#+title: Estimator
#+roam_tags: statistics estimator

- tags :: [[file:20210219102643-statistics.org][Statistics]]

* Setup :noexport:
#+call: init()
#+call: init-plot-style()

* Lib :noexport:
:PROPERTIES:
:header-args: :tangle encyclopedia/estimator.py :results silent
:END:

#+begin_src jupyter-python
import matplotlib.pyplot as plt
import numpy as np
from sympy import *
from sympy.stats import *
from pyorg.latex import *
#+end_src

* TODO Estimator
#+begin_src jupyter-python
sigmah = symbols('\\hat{\\sigma}', cls=Function)
sigma = symbols('sigma')
i = symbols('i', cls=Idx)
x = symbols('x', cls=IndexedBase)
X1 = Normal('X_1', 0, sigma)
X2 = Normal('X_2', 0, sigma)

estimator = LEq(sigmah(X1, X2)**2, (X1**2+X2**2)/2)
estimator
#+end_src

#+RESULTS:
:RESULTS:
\begin{equation}\hat{\sigma}^{2}{\left(X_{1},X_{2} \right)} = \frac{X_{1}^{2}}{2} + \frac{X_{2}^{2}}{2}\end{equation}
:END:

#+begin_src jupyter-python
LSteps(Expectation(estimator.lhs),
    lambda e: e.subs(estimator.lhs, estimator.rhs),
    lambda e: e.subs(estimator.lhs, estimator.rhs),
    lambda e: e.expand(),
    lambda e: Add(*[a.doit() for a in e.args], evaluate=False),
    lambda e: e.doit()
)
#+end_src

#+RESULTS:
:RESULTS:
\begin{equation}\begin{array}{l}
E[\hat{\sigma}^{2}{\left(X_{1},X_{2} \right)}]\Rightarrow\\
\quad \Rightarrow E[\frac{X_{1}^{2}}{2} + \frac{X_{2}^{2}}{2}]\Rightarrow\\
\quad \Rightarrow E[\frac{X_{1}^{2}}{2} + \frac{X_{2}^{2}}{2}]\Rightarrow\\
\quad \Rightarrow \frac{E[X_{1}^{2}]}{2} + \frac{E[X_{2}^{2}]}{2}\Rightarrow\\
\quad \Rightarrow \frac{\sigma^{2}}{2} + \frac{\sigma^{2}}{2}\Rightarrow\\
\quad \Rightarrow \sigma^{2}
\end{array}\end{equation}
:END:
